Show / Hide Table of Contents
Class GrpcSynchronousClient
GrpcClient implementation that waits for message callbacks.
Inheritance
System.Object
GrpcClient
GrpcSynchronousClient
Inherited Members
 GrpcClient.MessageReceived
 GrpcClient.ClientConnected
 GrpcClient.ClientDisconnected
 GrpcClient.ClientID
 GrpcClient.Port
 GrpcClient.IsConnected
 GrpcClient.RegisterHandler(String, IGrpcMessageHandler)
 GrpcClient.ConnectAsync()
 GrpcClient.DisconnectAsync()
 GrpcClient.SendMessageAsync(String, String, String)
 GrpcClient.SendMessageAsync(GrpcMessage)
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Grpc
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class GrpcSynchronousClient : GrpcClient
Constructors
Improve this Doc   View Source
GrpcSynchronousClient(String, Int32)
Initializes a new GrpcSynchronousClient
Declaration
public GrpcSynchronousClient(string clientId, int port)
Parameters
 Type |  Name |  Description
 System.String |  clientId
ID of the client.
 System.Int32 |  port
Methods
Improve this Doc   View Source
HandleMessageAsync(GrpcMessage)
Overrides the base HandleMessage.
Declaration
protected override Task HandleMessageAsync(GrpcMessage message)
Parameters
 Type |  Name |  Description
 GrpcMessage |  message
Returns
 Type |  Description
 System.Threading.Tasks.Task
Overrides
GrpcClient.HandleMessageAsync(GrpcMessage)
Improve this Doc   View Source
SendMessageSync(String, String)
Sends message and waits for the callback from the server.
Declaration
public GrpcMessage SendMessageSync(string messageName, string data)
Parameters
 Type |  Name |  Description
 System.String |  messageName
Message identificator.
 System.String |  data
Body of the message.
Returns
 Type |  Description
 GrpcMessage
 Improve this Doc
 View Source